# St7GetNFAModeParticipationCalculate

Returns the state of the mass participation option for natural frequency analysis.

long St7GetNFAModeParticipationCalculate(long uID, bool* Calculate)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
Calculate
True if the mass participation is calculated for each mode in the analysis.